app/controllers/bookmarks_controller.rb

    def create
        # TO DO: make sure you can't create duplicate recipes associations
        # Bookmark.find(bookmark_params)
        #     render json: {error: 'Recipe already bookmarked'}, status: :unprocessable_entity
        # rescue RecordNotFound
            render json: Bookmark.create(bookmark_params), status: :created
---
INSERT INTO "bookmarks" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["recipe_id", 4], ["created_at", "2022-05-28 22:00:36.119148"], ["updated_at", "2022-05-28 22:00:36.119148"]]

    def show
        byebug
        user = User.find(params[:user_id])
        user.bookmarks.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1  [["user_id", 1]]

    def index
        if params[:user_id]
            user = User.find(params[:user_id])
            render json: user.bookmarks
        else
            render json: Bookmark.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks"

    def destroy
        user = User.find(params[:user_id])
        bookmark = user.bookmarks.find_by(recipe_id: params[:id])
        bookmark.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."user_id" = $1 AND "bookmarks"."recipe_id" = $2 LIMIT $3  [["user_id", 1], ["recipe_id", 1], ["LIMIT", 1]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 7]]