app/controllers/recipes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes"
---
    def index
        if params[:user_id] && user = User.find(params[:user_id])
            render json: user.bookmarked_recipes, status: :ok
        else
            render json: Recipe.all, status: :ok

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def show
        render json: Recipe.find(params[:id])

INSERT INTO "recipes" ("name", "instructions", "time_to_make", "vegetarian", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "asdf"], ["instructions", "asdf"], ["time_to_make", 5], ["vegetarian", true], ["user_id", 1], ["created_at", "2022-05-30 18:14:11.844203"], ["updated_at", "2022-05-30 18:14:11.844203"]]
INSERT INTO "bookmarks" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["recipe_id", 9], ["created_at", "2022-05-30 18:14:12.102544"], ["updated_at", "2022-05-30 18:14:12.102544"]]
INSERT INTO "recipes" ("name", "instructions", "time_to_make", "vegetarian", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "qwerty"], ["instructions", "asdfasdfasdf"], ["time_to_make", 4], ["vegetarian", true], ["created_at", "2022-05-19 20:52:17.861596"], ["updated_at", "2022-05-19 20:52:17.861596"]]
---
    def create
        recipe = Recipe.create(recipe_params)
            user_id = session[:user_id]
            Bookmark.create(recipe_id: recipe[:id], user_id: user_id)

SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "recipes" SET "time_to_make" = $1, "updated_at" = $2 WHERE "recipes"."id" = $3  [["time_to_make", 20], ["updated_at", "2022-06-01 16:37:59.736160"], ["id", 5]]
---
    def update
        recipe = Recipe.find(params[:id])
        recipe.update(recipe_params)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "bookmarks".* FROM "bookmarks" WHERE "bookmarks"."recipe_id" = $1  [["recipe_id", 11]]
DELETE FROM "bookmarks" WHERE "bookmarks"."id" = $1  [["id", 18]]
DELETE FROM "user_recipes" WHERE "user_recipes"."id" = $1  [["id", 1]]
---
    def destroy
        user = User.find(session[:user_id])
        user_recipe = user.bookmarks.find_by(recipe_id: params[:id])
        render json: user_recipe.destroy

SELECT "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."recipe_id" = $1  [["recipe_id", 1]]
---
    def favorites
        render json: Recipe.first