app/controllers/recipes_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."user_id" = $1 AND "user_recipes"."recipe_id" = $2 LIMIT $3  [["user_id", 2], ["recipe_id", 7], ["LIMIT", 1]]
DELETE FROM "user_recipes" WHERE "user_recipes"."id" = $1  [["id", 7]]
---
    def destroy
        user = User.find(session[:user_id])
        if user.id == 1
            recipe = Recipe.find(params[:id])
            recipe.destroy
        else

            recipe = user.user_recipes.find_by(recipe_id: params[:id])
            render json: recipe.destroy