app/controllers/saved_recipes_controller.rb

INSERT INTO "saved_recipes" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["recipe_id", 2], ["created_at", "2022-05-27 19:30:48.672457"], ["updated_at", "2022-05-27 19:30:48.672457"]]
---
    def create
        # TO DO: make sure you can't create duplicate recipes associations
       render json: SavedRecipe.create(user_id: params[:user_id], recipe_id: params[:recipe_id]), status: :created

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def user_index
        user = User.find(params[:user_id])