app/controllers/user_recipes_controller.rb

INSERT INTO "user_recipes" ("user_id", "recipe_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 2], ["recipe_id", 1], ["created_at", "2022-05-18 20:43:49.455879"], ["updated_at", "2022-05-18 20:43:49.455879"]]
---
    def create
        # TO DO: make sure you can't create duplicate recipes associations
       render json: UserRecipe.create(user_id: params[:user_id], recipe_id: params[:recipe_id]), status: :created

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def user_index
        user = User.find_by(id: session[:user_id])

SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
SELECT "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."user_id" = $1 AND "user_recipes"."recipe_id" = $2 LIMIT $3  [["user_id", 2], ["recipe_id", 10], ["LIMIT", 1]]
DELETE FROM "user_recipes" WHERE "user_recipes"."id" = $1  [["id", 1]]
---
    def destroy
        byebug
        user = User.find_by(id: session[:user_id])
        recipe = user.user_recipes.find(params[:id])
        render json: recipe.destroy