app/controllers/users_controller.rb

  def show
    user = User.find_by(id: session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "leavingvalhalla"], ["password_digest", "[FILTERED]"], ["created_at", "2022-05-13 01:51:17.727688"], ["updated_at", "2022-05-13 01:51:17.727688"]]